0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{


    inlet
    {
         type            freestream;
	freestreamValue 0;
    }


 

    outlet
    {
        type            calculated;
        value           uniform 0;
    }


    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    topAndBottom
    {
         type            zeroGradient;
    }

    kobra
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }


    nozzle
    {
        type            calculated;
        value           uniform 0;
    }


}


// ************************************************************************* //
